loadtest/results/atomic-spread.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/spread.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * spread: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 42684 complete and 0 interrupted iterations
spread   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 101153 complete and 0 interrupted iterations
spread   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 165700 complete and 0 interrupted iterations
spread   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 226591 complete and 0 interrupted iterations
spread   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 296543 complete and 0 interrupted iterations
spread   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 355449 complete and 0 interrupted iterations
spread   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 402700 complete and 0 interrupted iterations
spread   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 452175 complete and 0 interrupted iterations
spread   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 505488 complete and 0 interrupted iterations
spread   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 568518 complete and 0 interrupted iterations
spread   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 637577 complete and 0 interrupted iterations
spread   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 697562 complete and 0 interrupted iterations
spread   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 762187 complete and 0 interrupted iterations
spread   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 827973 complete and 0 interrupted iterations
spread   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 887767 complete and 0 interrupted iterations
spread   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 953081 complete and 0 interrupted iterations
spread   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 1024315 complete and 0 interrupted iterations
spread   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 1076863 complete and 0 interrupted iterations
spread   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 1146299 complete and 0 interrupted iterations
spread   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 1217303 complete and 0 interrupted iterations
spread   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 1288141 complete and 0 interrupted iterations
spread   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 1353904 complete and 0 interrupted iterations
spread   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 1427124 complete and 0 interrupted iterations
spread   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 1498615 complete and 0 interrupted iterations
spread   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 1570950 complete and 0 interrupted iterations
spread   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 1641461 complete and 0 interrupted iterations
spread   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 1710879 complete and 0 interrupted iterations
spread   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 1784620 complete and 0 interrupted iterations
spread   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 1846615 complete and 0 interrupted iterations
spread   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 1917879 complete and 0 interrupted iterations
spread   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    booking_failed
    ✗ 'count==0' count=1918197

    http_req_duration
    ✓ 'p(95)<1000' p(95)=2.03ms


  █ TOTAL RESULTS 

    checks_total.......: 1918197 63937.903982/s
    checks_succeeded...: 0.00%   0 out of 1918197
    checks_failed......: 100.00% 1918197 out of 1918197

    ✗ settled as 201 or 409
      ↳  0% — ✓ 0 / ✗ 1918197

    CUSTOM
    booking_failed.......: 1918197 63937.903982/s

    HTTP
    http_req_duration....: avg=664.07µs min=17.54µs med=424.54µs max=84.35ms p(90)=1.44ms p(95)=2.03ms
    http_req_failed......: 100.00% 1918197 out of 1918197
    http_reqs............: 1918197 63937.903982/s

    EXECUTION
    iteration_duration...: avg=767.06µs min=33.25µs med=495.54µs max=89.22ms p(90)=1.64ms p(95)=2.32ms
    iterations...........: 1918197 63937.903982/s
    vus..................: 50      min=50                 max=50
    vus_max..............: 50      min=50                 max=50

    NETWORK
    data_received........: 382 MB  13 MB/s
    data_sent............: 335 MB  11 MB/s



running (0m30.0s), 00/50 VUs, 1918197 complete and 0 interrupted iterations
spread ✓ [ 100% ] 50 VUs  30s