loadtest/results/optimistic-hot_seat.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/hot_seat.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * hot_seat: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 5197 complete and 0 interrupted iterations
hot_seat   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 11733 complete and 0 interrupted iterations
hot_seat   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 19555 complete and 0 interrupted iterations
hot_seat   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 25584 complete and 0 interrupted iterations
hot_seat   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 33732 complete and 0 interrupted iterations
hot_seat   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 40834 complete and 0 interrupted iterations
hot_seat   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 47402 complete and 0 interrupted iterations
hot_seat   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 54398 complete and 0 interrupted iterations
hot_seat   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 61385 complete and 0 interrupted iterations
hot_seat   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 68373 complete and 0 interrupted iterations
hot_seat   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 75336 complete and 0 interrupted iterations
hot_seat   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 81379 complete and 0 interrupted iterations
hot_seat   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 89202 complete and 0 interrupted iterations
hot_seat   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 97194 complete and 0 interrupted iterations
hot_seat   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 105369 complete and 0 interrupted iterations
hot_seat   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 113181 complete and 0 interrupted iterations
hot_seat   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 120555 complete and 0 interrupted iterations
hot_seat   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 128014 complete and 0 interrupted iterations
hot_seat   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 135440 complete and 0 interrupted iterations
hot_seat   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 143520 complete and 0 interrupted iterations
hot_seat   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 151771 complete and 0 interrupted iterations
hot_seat   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 159945 complete and 0 interrupted iterations
hot_seat   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 168294 complete and 0 interrupted iterations
hot_seat   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 176245 complete and 0 interrupted iterations
hot_seat   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 184568 complete and 0 interrupted iterations
hot_seat   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 192941 complete and 0 interrupted iterations
hot_seat   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 201272 complete and 0 interrupted iterations
hot_seat   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 207718 complete and 0 interrupted iterations
hot_seat   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 214522 complete and 0 interrupted iterations
hot_seat   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 221451 complete and 0 interrupted iterations
hot_seat   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    booking_failed
    ✓ 'count==0' count=0

    http_req_duration
    ✓ 'p(95)<1000' p(95)=10.17ms


  █ TOTAL RESULTS 

    checks_total.......: 221531  7382.126151/s
    checks_succeeded...: 100.00% 221531 out of 221531
    checks_failed......: 0.00%   0 out of 221531

    ✓ settled as 201 or 409

    CUSTOM
    booking_conflicted.............: 221500 7381.093131/s
    booking_failed.................: 0      0/s
    booking_won....................: 31     1.03302/s

    HTTP
    http_req_duration..............: avg=6.73ms min=521.87µs med=6.68ms max=70.5ms  p(90)=8.83ms p(95)=10.17ms
      { expected_response:true }...: avg=6.73ms min=521.87µs med=6.68ms max=70.5ms  p(90)=8.83ms p(95)=10.17ms
    http_req_failed................: 0.00%  0 out of 221531
    http_reqs......................: 221531 7382.126151/s

    EXECUTION
    iteration_duration.............: avg=6.76ms min=561.45µs med=6.7ms  max=70.65ms p(90)=8.87ms p(95)=10.23ms
    iterations.....................: 221531 7382.126151/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 38 MB  1.3 MB/s
    data_sent......................: 39 MB  1.3 MB/s



running (0m30.0s), 00/50 VUs, 221531 complete and 0 interrupted iterations
hot_seat ✓ [ 100% ] 50 VUs  30s